html/20231126T001417--magic-mirror-setup__raspberrypi.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>magic mirror setup</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">16 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T001417--magic-mirror-setup__raspberrypi.html">magic mirror setup</a></h1>
<p>
irasyk ir setup raspberry pi kaip cia - <a href="20231126T001334--raspberrypi-first-setup__raspberrypi.html">raspberry pi first setup</a>
</p>

<p>
third party modules -
<a href="https://github.com/MichMich/MagicMirror/wiki/3rd-Party-Modules">https://github.com/MichMich/MagicMirror/wiki/3rd-Party-Modules</a>
</p>

<div class="org-src-container">
<pre class="src src-bash"># quit
Ctrl + q
# start (while inside MagicMirror folder on desktop to start the app)
npm start
</pre>
</div>

<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=-cJdwlDPqYM">pamatuok kiek telikas energijos ims naudojamas visa diena, per metus</a></li>
<li><a href="https://www.instructables.com/Gesture-Controlled-Smart-Mirror/">control with gesture</a></li>
<li><a href="https://www.youtube.com/watch?v=Zo1WT2LoaUg">temperature/humidity sensor</a></li>
<li>ismanioji rozete</li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-raspberrypi.html">raspberrypi</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
